//COV1903J JOB 1,NOTIFY=&SYSUID
//***************************************************
//*STEP-1 COMPILIG CALLED SUBROUTINE ...
//CALLED  EXEC IGYWCL
//COBOL.SYSLIB DD DSN=&SYSUID..COBOL.CPY,DISP=SHR
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(SUB0002),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(SUB0002),DISP=SHR
//* STEP-2 COMPILIG CALLER PGM ...
//CALLER  EXEC IGYWCL
//COBOL.SYSLIB DD DSN=&SYSUID..COBOL.CPY,DISP=SHR
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(COV1903),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(COV1903),DISP=SHR
//***************************************************
//* Include SubRoutine SUB0002 ...
//LKED.SYSLIB  DD  DSNAME=CEE.SCEELKED,DISP=SHR
//             DD  DSNAME=CEE.SCEELKEX,DISP=SHR
//             DD  DSNAME=&SYSUID..LOAD,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE SYSLIB(SUB0002)
// IF RC = 0 THEN
//***************************************************
//*STEP3
//RUN     EXEC PGM=COV1903
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//COUNTRYS  DD DSN=&SYSUID..COUNTRYS,DISP=SHR
//COVID19D  DD DSN=&SYSUID..COVID19D,DISP=SHR
//PRTLINE   DD SYSOUT=*,OUTLIM=15000
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//*CEEDUMP   DD SYSOUT=*,OUTLIM=15000
//SYSUDUMP  DD DUMMY
//***************************************************
// ELSE
// ENDIF